#+begin_src octave :results output
  rng("default");
  a=round(rand(3,5)*100)
  b=a([1, 3], [2, 4, 5])
  c=a(2 * ones(1, 20), [1, 3, 5])
  d=a(:, [1, 5, 3, 4, 2])
  a+=[zeros(3, 4), 100 * a(:, 1)]
#+end_src

#+RESULTS:
#+begin_example
a =

   84   26   78   58   28
   76   51   30   91   76
   42   40   48   50   62

b =

   26   58   28
   40   50   62

c =

   76   30   76
   76   30   76
   76   30   76
   76   30   76
   76   30   76
   76   30   76
   76   30   76
   76   30   76
   76   30   76
   76   30   76
   76   30   76
   76   30   76
   76   30   76
   76   30   76
   76   30   76
   76   30   76
   76   30   76
   76   30   76
   76   30   76
   76   30   76

d =

   84   28   78   58   26
   76   76   30   91   51
   42   62   48   50   40

a =

     84     26     78     58   8428
     76     51     30     91   7676
     42     40     48     50   4262

#+end_example

#+begin_src octave :results output
  A=[1:4;5:8;9:12;13:16]
  fliplr(A)
  flipud(A)
  A([end:-1:1],:)
  rot90(rot90(A))
  flipud(rot90(rot90(A)))
#+end_src

#+RESULTS:
#+begin_example
A =

    1    2    3    4
    5    6    7    8
    9   10   11   12
   13   14   15   16

ans =

    4    3    2    1
    8    7    6    5
   12   11   10    9
   16   15   14   13

ans =

   13   14   15   16
    9   10   11   12
    5    6    7    8
    1    2    3    4

ans =

   13   14   15   16
    9   10   11   12
    5    6    7    8
    1    2    3    4

ans =

   16   15   14   13
   12   11   10    9
    8    7    6    5
    4    3    2    1

ans =

    4    3    2    1
    8    7    6    5
   12   11   10    9
   16   15   14   13

#+end_example
